{"_id":{"$oid":"644d82679c8994cbad37b8bc"},"Title":"Silence of the Lambs","Description":"A young FBI cadet must receive the help of an incarcerated and manipulative cannibal killer to help catch another serial killer.","Genre":{"Name":"Thriller","Description":"Thriller film, also known as suspense film or suspense thriller, is a broad film genre that involves excitement and suspense in the audience."},"Director":{"Name":"Jonathan Demme","Bio":"Robert Jonathan Demme was an American director, producer, and screenwriter.","Birth":"1944","Death":"2017"},"ImagePath":"silenceofthelambs.png","Featured":true}
{"_id":{"$oid":"644d8eef9c8994cbad37b8bd"},"Title":"A Knights Tale","Description":"After his master dies, a peasant squire, fueled by his desire for foog and glory, creates a new identity for himself as a knight.","Genre":{"Name":"Romantic Comedy","Description":"A light, comic movie or other work whose plot focuses on the development of a romantic relationship."},"Director":{"Name":"Brian Thomas Helgeland","Bio":"An American screenwriter, film producer and director. Most known for writinf the screenplays for L.A. Confidential and Mystic River.","Birth":"1961"},"ImagePath":"KT.jpeg","Featured":true}
{"_id":{"$oid":"644d9ed69c8994cbad37b8be"},"Title":"Life is Beautiful","Description":"A gentle Jewish-Italian waiter meets a pretty schoolteacher, and wins her over with his charm and humor. Eventually they marry and have a son, Giosue. Their happiness is abruptly halted, however, when the Guido and his son Giosue are separated from Dora, the mother, and taken to a concentration camp. Determined to shelter his son from the horrors of his surroundings, Guido convinces Giosue that their time in the camp is merely a game.","Genre":{"Name":"Drama","Description":"In film and television, drama is a category or genre of narrative fiction (or semi-fiction) intended to be more serious than humorous in tone."},"Director":{"Name":"Roberto Begnini","Bio":"Italian actor, comedian, screenwriter adn director. He gained international recognition for writing, directing and starring in the Holocaust comedy-drama film Life is Beautiful (1997), for which he received the Academy Awards for Best Actor and Best International Feature Film. Begnini remains the only actor to win the Best Actor Award for a non-English language performance.","Birth":"1952"},"ImagePath":"Vitaebella.jpeg","Featured":false}
{"_id":{"$oid":"644da4819c8994cbad37b8bf"},"Title":"The Pale Blue Eye","Description":"A world-weary detective is hired to investigate the murder of a West Point cadet. Stymied by the cadets code of silence he enlists one their own to help unravel the case - a young man the world would come to know as Edgar Allan Poe.","Genre":{"Name":"Horror","Description":"The Dictionary of Film Studies defines the horror fild as representing: disturbing adn dark subject matter, seeking to elicit responses of fear, terror, disgust, shock, suspense, and, of course, horror from their viewers."},"Director":{"Name":"Scott Cooper","Bio":"Scott Cooper is an American director, screenwriter, producer and actor. He is known for writing and directing Crazy Heart (2009), Out of the Furnace (2013), Black Mass (2015), and Hostiles (2017)","Birth":"1970"},"ImagePath":"PBE.jpeg","Featured":false}
{"_id":{"$oid":"644dab309c8994cbad37b8c0"},"Title":"Flight","Description":"An airline pilot saves almost all his passengers on his malfunctioning airliner which eventually crashed, but an investigation into the accident reveals something troubling.","Genre":{"Name":"Action","Description":"Action film is a genre in which the protagonist is thrust into a series of events that typically involve violence and physical feats."},"Director":{"Name":"Robert Zemeckis","Bio":"Robert Lee Zemeckis is an American filmmaker. He first came to public attention as the director of Back to the Future film trilogy, and the live-actino/animated comedy Who Framed Roger Rabbit.","Birth":"1952"},"ImagePath":"Flight.jpeg","Featured":true}
{"_id":{"$oid":"644db07b9c8994cbad37b8c1"},"Title":"Forrest Gumb","Description":"the presidencies of Kennedy and Johnson, the Vietnam War, the Watergate scandal and other historical events unfold from the perspective from an Alabama man with an IQ of 75, whose only desire is to be reunited with his childhood sweetheart.","Genre":{"Name":"Drama","Description":"In film and television, drama is a category or genre of narrative fiction (or semi-fiction) intended to be more serious than humorous tone."},"Director":{"Name":"Robert Zemeckis","Bio":"Robert Lee Zemeckis is an American filmmaker. He first came to public attention as the director of Back to the Future film trilogy, and the live-actino/animated comedy Who Framed Roger Rabbit","Birth":"1952"},"ImagePath":"FGP.jpeg","Featured":true}
{"_id":{"$oid":"644db41e9c8994cbad37b8c2"},"Title":"A Nightmare on Elm Street","Description":"Teenager Nancy Thompson must uncover the dark truth concealed by her parents after she and her friends become targets of the spirit of a serial killer with a bladed glove in their dreams, in which if they die, it kills them in real life.","Genre":{"name":"Horror","Description":"The Dictionary of Film Studies defines the horror film as representing: disturbing and dark subject matter, seeking to elicit responses of fear, terror, disgust, shock, suspense, and, of course, horror from their viewers."},"Director":{"Name":"Wes Craven","Bio":"Wesley Earl Craven was an American film director, screenwriter, producer, actor, adn editor. Craven has commonly been recognized as one of the greatest masters of the horror genre due to the cultural impact of his work.","Birth":"1939"},"ImagePath":"Freddy.jpeg","Featured":true}
{"_id":{"$oid":"644dbb3a9c8994cbad37b8c3"},"Title":"Ready Player One","Description":"When the creator of a virtual reality called OASIS dies, he makes a posthumous challenge to all OASIS users to fing his Easter Egg, which will give the finder his fortune and control of his world.","Genre":{"Name":"Sci-fi","Description":"Sci-fi is a form of fiction that deals principally with the impact of actual or imagined science upon society or individuals."},"Director":{"Name":"Steven Spielberg","Bio":"Steven Allan Spielberg KBE is an American Filmmaker. A major figure of the new Hollywood era and pioneer of the modern blockbuster, he is the most commercially successful director of all time.","Birth":"1946"},"ImagePath":"rpo.jpeg","Featured":true}
{"_id":{"$oid":"644ed50f9c8994cbad37b8c4"},"Description":"Legend is adapted from John Pearson's book The Profesison of Violence: The Rise and Fall of the Kray Twins, which deals with their career and the relationship that bound them together, and follows their gruesome career to life imprisonment in 1969.","Genre":{"Name":"Drama","Description":"In film and television, drama is a category or genre of narrative fiction (or semi-fiction) intended to be more serious than humorous in tone."},"Director":{"Name":"Brian Helgeland","Bio":" Brian Thomas Helgeland is an American screenwriter, film producer and director. He is most known for writing the screenplays for the films L.A Confidential and Mystic River.","Birth":"1961"},"ImagePath":"legend.jpeg","Featured":true}
{"_id":{"$oid":"644edb2c9c8994cbad37b8c5"},"Title":"10 Things I Hate About You","Description":"The film follows new student Cameron who is smitten with Bianca and, in order to get around her father's strict rules on dating, attempts to get bad boy Patrick to date Bianca's antisocial sister, Kat. The film is name after a poem Kat writes about her romance with Patrick.","Genre":{"Name":"Romantic Comedy","Description":"A light, comic movie or other work whose plot focuses on the development of a romantic relationship."},"Director":{"Name":"Gil Junger","Bio":"Gil Junger is an American director, most famous for 10 Things I Hate About You, his directorial film debut. He is a 1972 graduate of the Trinity-Pawling School in Pawling, New York.","Birth":"1954"},"ImagePath":"10things.jpeg","Featured":false}
{"_id":{"$oid":"644eeca89c8994cbad37b8c6"},"Title":"Beauty and the Briefcase","Description":"A freelance writer looking for romance sells a story to Cosmopolitan magazine about finding love in the workplace and goes undercover at a Finance Company.","Genre":{"Name":"Romantic Comedy","Description":"A light, comic movie or other work whose plot focuses on the development of a romantic relationship."},"Director":{"Name":"Gil Junger","Bio":"Gil Junger is an American director, most famous for 10 Things I Hate About You, his directorial debut. He is a 1972 graduate of the Trinity-Pawling School in Pawling, New York.","Birth":"1954"},"ImagePath":"Bab.jpeg","Featured":false}
